christian-kohler.path-intellisense
esbenp.prettier-vscode
github.copilot
github.copilot-chat
kokororin.vscode-phpfmt
mikeburgh.xml-format
ms-vscode-remote.remote-ssh
nguyenhuy158.xml-formater
openai.chatgpt
pkief.material-icon-theme
rangav.vscode-thunder-client
sburg.vscode-javascript-booster
usernamehw.errorlens
valeryanm.vscode-phpsab
wallabyjs.quokka-vscode



on the other file use this command
------------------------------------
xargs -n 1 code --install-extension < ~/Desktop/vscode-extensions.txt